tema-mazy/mazy-iot/esp32/test/eink-test/sdkconfig.defaults
# LilyGO T5 V2.3 carries an ESP32-WROVER-B (4 MB flash, 8 MB PSRAM).
CONFIG_IDF_TARGET="esp32"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# The e-paper refresh is slow; give the main task room and a relaxed WDT.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
